bookers2-debug/app/views/book_comments/index.html.erb

          <% end %>
          <%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", "5"]]

          <td>
          コメント数:<%= @book.book_comments.count %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 8]]