bookers2-debug/app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 21], ["followed_id", 3], ["created_at", "2021-05-09 13:18:09.442944"], ["updated_at", "2021-05-09 13:18:09.442944"]]
---
  def follow(user_id)
    unless self.id == user_id
      self.relationships.find_or_create_by(followed_id: user_id)