bookers2-debug/app/models/user.rb

SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", "12"], ["book_id", "8"], ["LIMIT", 1]]
---
  def already_favorited?(book)
    self.favorites.exists?(book_id: book.id)