bookers2-debug/app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def index
    @new_book = Book.new
    @user = current_user
    @book = Book.find(params[:book_id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 19], ["book_id", 11], ["content", "kkkkkkkkkkk"], ["created_at", "2021-05-06 07:29:46.272483"], ["updated_at", "2021-05-06 07:29:46.272483"]]
---
  def create
    @book_comment = BookComment.new(book_comment_params)
    @book_comment.user_id = current_user.id
    @book = Book.find(params[:book_id])
    if @book_comment.save

SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 8], ["book_id", 0], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 31]]
---
  def destroy
    @book_comment = BookComment.find_by(id: params[:id], book_id: params[:book_id])
    @book_comment.destroy