bookers2-debug/app/controllers/books_controller.rb

  def create
    @user = current_user
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "bhubhu"], ["body", "vgyvgyvgyvgyvgygvyg"], ["user_id", 8], ["created_at", "2021-05-03 11:08:39.638636"], ["updated_at", "2021-05-03 11:08:39.638636"]]
SELECT "books".* FROM "books"