bookers2-debug/app/controllers/favorites_controller.rb

  def create
    @favorite = current_user.favorites.create(book_id: params[:book_id])
---
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", "12"], ["book_id", "2"], ["created_at", "2021-05-04 10:09:19.861703"], ["updated_at", "2021-05-04 10:09:19.861703"]]