bookers2-debug/app/controllers/relationships_controller.rb

  def set_user
    @user = User.find(params[:relationship, :followed_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]