bookers2-debug/app/controllers/relationships_controller.rb

  def create
    current_user.active_relationships.create(followed_id: params[:user_id])
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 21], ["followed_id", 21], ["created_at", "2021-05-09 12:21:21.600834"], ["updated_at", "2021-05-09 12:21:21.600834"]]

  def destroy
    current_user.active_relationships.find_by(followed_id: params[:user_id]).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]